Revit 2027 API
ParameterTypeId.FabricationPartCutType Property
 "Cut Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartCutType { get; }
Public Shared ReadOnly Property FabricationPartCutType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartCutType {
	ForgeTypeId^ get ();
}
static member FabricationPartCutType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace